api/app/controllers/api/v1/places_controller.rb

    def index
        @places = Place.all
---
SELECT  "places".* FROM "places" WHERE "places"."placeid" = $1 LIMIT $2  [["placeid", "ChIJbQx870SuPIgRG35NOMlQE68"], ["LIMIT", 1]]

    def show
        @place = Place.where(address: params[:address])
---
SELECT "places".* FROM "places" WHERE "places"."address" IS NULL