api/app/controllers/favorites_controller.rb

    def index
        user_id = params[:user_id]
        @user = User.find(user_id)
        @places = @user.places
        time = Time.now.in_time_zone("Eastern Time (US & Canada)")
        @occupancies = []
        @places.each do |place|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "places".* FROM "places" INNER JOIN "favorites" ON "places"."id" = "favorites"."place_id" WHERE "favorites"."user_id" = $1  [["user_id", 1]]

    def create
        user_id = params[:user_id]
        place_id = params[:place_id]
        @favorite = Favorite.new(
            user_id: user_id,
            place_id: place_id
        )
        unless @favorite.save
---
INSERT INTO "favorites" ("place_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["place_id", 1], ["user_id", 1], ["created_at", 2016-11-18 05:03:20 UTC], ["updated_at", 2016-11-18 05:03:20 UTC]]