api/app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE "places"."address" IS NULL
---
    def update
        @place = Place.where(address: params[:address])