api/app/controllers/places_controller.rb

        @places_db = []
        @places.each_with_index do |place, index|
            place_id = place.place_id
            place_db = Place.find_by(place_id: place_id)
            unless place_db.nil?
                #occupancy = place_db.occupancy
                #@occupancies.push(occupancy)
                @places_db.push(place_db)
---
SELECT  "places".* FROM "places" WHERE "places"."place_id" = $1 LIMIT $2  [["place_id", "ChIJMx9D1A2wPIgR4rXIhkb5Cds"], ["LIMIT", 1]]
INSERT INTO "places" ("placeid", "occupancy", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["placeid", "ChIJL0nLAz-uPIgR9iMROI_YD7k"], ["occupancy", 5.0], ["created_at", 2016-11-17 05:32:23 UTC], ["updated_at", 2016-11-17 05:32:23 UTC]]

    def update
        @location = request.location
        @place = Place.find(params[:id])
        unless @place
            flash[:danger] = "Place not found"
            return redirect_to root_path
        end
        average = (params[:occupancy].to_f + @place.occupancy)/2
        unless @place.update(occupancy: average)
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "places" SET "occupancy" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["occupancy", 3.0], ["updated_at", 2016-11-17 14:21:51 UTC], ["id", 3]]