api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "andrew"], ["password", "andrew"], ["created_at", 2016-11-17 21:55:56 UTC], ["updated_at", 2016-11-17 21:55:56 UTC]]
---
    def create
        @user = User.new(user_params)
        if @user.save